In [1]:
#import dependencies and file
import pandas as pd

salary_df = pd.read_csv("Resources/data_salaries_cleaned.csv")
salary_df

,Unnamed: 0,work_year,experience_level,employment_type,job_title,salary,remote_ratio,company_size
0,0,2023,MI,FT,Analytics Engineer,300000,0,M
1,1,2023,MI,FT,Analytics Engineer,60000,0,M
2,2,2023,MI,FT,Data Scientist,150000,0,M
3,3,2023,MI,FT,Data Scientist,125000,0,M
4,4,2023,SE,FT,Data Scientist,150000,100,M
...,...,...,...,...,...,...,...,...
7872,7913,2021,SE,FT,Data Specialist,165000,100,L
7873,7914,2020,SE,FT,Data Scientist,412000,100,L
7874,7915,2021,MI,FT,Principal Data Scientist,151000,100,L
7875,7916,2020,EN,FT,Data Scientist,105000,100,S
7876,7918,2021,SE,FT,Data Science Manager,7000000,50,L

In [2]:
experience_entry_df = salary_df.loc[(salary_df["experience_level"]=="EN")]
experience_entry_df["job_title"].value_counts()

job_title
Data Engineer                         88
Data Analyst                          87
Data Scientist                        75
Research Scientist                    21
Machine Learning Engineer             19
Research Engineer                     15
Data Integration Specialist            8
AI Scientist                           6
BI Data Analyst                        6
Applied Scientist                      6
Data Science Consultant                6
Analytics Engineer                     5
AI Developer                           5
Machine Learning Developer             5
Business Data Analyst                  4
Applied Data Scientist                 4
Research Analyst                       4
AI Programmer                          4
Big Data Engineer                      3
Computer Vision Engineer               3
Machine Learning Scientist             3
ML Engineer                            2
Cloud Data Engineer                    2
Computer Vision Software Engineer      2
Applied Machine Learning Scientist     2
BI Developer                           2
AI Research Engineer                   2
Compliance Data Analyst                2
Deep Learning Engineer                 2
Data Manager                           2
Machine Learning Research Engineer     2
Finance Data Analyst                   1
Product Data Analyst                   1
Data Analytics Engineer                1
Data Specialist                        1
BI Analyst                             1
Marketing Data Engineer                1
Azure Data Engineer                    1
AI Engineer                            1
BI Data Engineer                       1
Data Quality Engineer                  1
Data Science Engineer                  1
Business Intelligence Data Analyst     1
Financial Data Analyst                 1
Name: count, dtype: int64

In [3]:
salary_df["job_title"].value_counts().head(20)

job_title
Data Engineer                     1873
Data Scientist                    1675
Data Analyst                      1179
Machine Learning Engineer          801
Applied Scientist                  226
Research Scientist                 217
Analytics Engineer                 216
Data Architect                     177
Research Engineer                  123
Data Manager                       122
Business Intelligence Engineer      98
Data Science Manager                90
ML Engineer                         85
Machine Learning Scientist          66
BI Developer                        42
Data Analytics Manager              39
Decision Scientist                  36
Data Specialist                     36
Data Science Consultant             34
Business Intelligence Analyst       32
Name: count, dtype: int64

In [4]:
salary_df["work_year"].value_counts()

work_year
2023    5964
2022    1636
2021     208
2020      69
Name: count, dtype: int64

In [5]:
#separate by year
salary_df_2020 = salary_df.loc[(salary_df["work_year"]==2020)]
salary_df_2021 = salary_df.loc[(salary_df["work_year"]==2021)]
salary_df_2022 = salary_df.loc[(salary_df["work_year"]==2022)]
salary_df_2023 = salary_df.loc[(salary_df["work_year"]==2023)]

In [6]:
#find total average salary in the field for each year
average_salary_2020 = salary_df_2020["salary"].mean()
average_salary_2021 = salary_df_2021["salary"].mean()
average_salary_2022 = salary_df_2022["salary"].mean()
average_salary_2023 = salary_df_2023["salary"].mean()

print(average_salary_2020)
print(average_salary_2021)
print(average_salary_2022)
print(average_salary_2023)

383113.17391304346
579841.1586538461
167129.77383863082
163339.29828973842

In [7]:
#Find mean by level of position for each year
average_entry_2020 = salary_df_2020.loc[salary_df_2020["experience_level"]=="EN",["salary"]].mean()
average_entry_2021 = salary_df_2021.loc[salary_df_2021["experience_level"]=="EN",["salary"]].mean()
average_entry_2022 = salary_df_2022.loc[salary_df_2022["experience_level"]=="EN",["salary"]].mean()
average_entry_2023 = salary_df_2023.loc[salary_df_2023["experience_level"]=="EN",["salary"]].mean()

print(average_entry_2020)
print(average_entry_2021)
print(average_entry_2022)
print(average_entry_2023)

salary    347423.529412
dtype: float64
salary    302394.181818
dtype: float64
salary    222893.794393
dtype: float64
salary    132983.107438
dtype: float64

In [9]:
#Finding mean by job title by year. Narrowing down to the most popular job titles, 
#which are Data Analyst, Data Engineer, Data Scientist, and Machine Learning Engineer
#Start with 2020
average_salary_2020_DA = salary_df_2020.loc[salary_df_2020["job_title"]=="Data Analyst",["salary"]].mean()
average_salary_2020_DE = salary_df_2020.loc[salary_df_2020["job_title"]=="Data Engineer",["salary"]].mean()
average_salary_2020_DS = salary_df_2020.loc[salary_df_2020["job_title"]=="Data Scientist",["salary"]].mean()
average_salary_2020_MLE = salary_df_2020.loc[salary_df_2020["job_title"]=="Machine Learning Engineer",["salary"]].mean()

print(average_salary_2020_DA)
print(average_salary_2020_DE)
print(average_salary_2020_DS)
print(average_salary_2020_MLE)

salary    58500.0
dtype: float64
salary    471638.384615
dtype: float64
salary    780915.5
dtype: float64
salary    144500.0
dtype: float64

In [10]:
#2021 by title
average_salary_2021_DA = salary_df_2021.loc[salary_df_2021["job_title"]=="Data Analyst",["salary"]].mean()
average_salary_2021_DE = salary_df_2021.loc[salary_df_2021["job_title"]=="Data Engineer",["salary"]].mean()
average_salary_2021_DS = salary_df_2021.loc[salary_df_2021["job_title"]=="Data Scientist",["salary"]].mean()
average_salary_2021_MLE = salary_df_2021.loc[salary_df_2021["job_title"]=="Machine Learning Engineer",["salary"]].mean()

print(average_salary_2021_DA)
print(average_salary_2021_DE)
print(average_salary_2021_DS)
print(average_salary_2021_MLE)

salary    139872.8
dtype: float64
salary    212195.0
dtype: float64
salary    1138821.0
dtype: float64
salary    445668.944444
dtype: float64

In [11]:
#2022 by title
average_salary_2022_DA = salary_df_2022.loc[salary_df_2022["job_title"]=="Data Analyst",["salary"]].mean()
average_salary_2022_DE = salary_df_2022.loc[salary_df_2022["job_title"]=="Data Engineer",["salary"]].mean()
average_salary_2022_DS = salary_df_2022.loc[salary_df_2022["job_title"]=="Data Scientist",["salary"]].mean()
average_salary_2022_MLE = salary_df_2022.loc[salary_df_2022["job_title"]=="Machine Learning Engineer",["salary"]].mean()

print(average_salary_2022_DA)
print(average_salary_2022_DE)
print(average_salary_2022_DS)
print(average_salary_2022_MLE)

salary    108559.320896
dtype: float64
salary    144091.868583
dtype: float64
salary    183522.65586
dtype: float64
salary    165218.11215
dtype: float64

In [12]:
#2023 by title
average_salary_2023_DA = salary_df_2023.loc[salary_df_2023["job_title"]=="Data Analyst",["salary"]].mean()
average_salary_2023_DE = salary_df_2023.loc[salary_df_2023["job_title"]=="Data Engineer",["salary"]].mean()
average_salary_2023_DS = salary_df_2023.loc[salary_df_2023["job_title"]=="Data Scientist",["salary"]].mean()
average_salary_2023_MLE = salary_df_2023.loc[salary_df_2023["job_title"]=="Machine Learning Engineer",["salary"]].mean()

print(average_salary_2023_DA)
print(average_salary_2023_DE)
print(average_salary_2023_DS)
print(average_salary_2023_MLE)

salary    115220.681356
dtype: float64
salary    151765.509716
dtype: float64
salary    169398.857496
dtype: float64
salary    191471.331845
dtype: float64

In [ ]:
#Create dataframe for